app/controllers/chats_controller.rb

  def show
    @user = User.find(params[:id])
    rooms = current_user.user_rooms.pluck(:room_id)
    user_rooms = UserRoom.find_by(user_id: @user.id, room_id: rooms)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" IN (?, ?) LIMIT ?  [["user_id", 2], ["room_id", 1], ["room_id", 2], ["LIMIT", 1]]