app/controllers/relationships_controller.rb

  def follow
    @user = User.find(params[:id])
    current_user.follow(params[:id])
    @user.create_notification_follow!(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "notifications" ("visiter_id", "visited_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["visiter_id", 3], ["visited_id", 2], ["created_at", "2021-04-14 06:29:33.679640"], ["updated_at", "2021-04-14 06:29:33.679640"]]