app/models/user.rb

  def create_notification_follow!(current_user)
    temp = Notification.where(["visitor_id = ? and visited_id = ? and action = ? ", current_user.id, id, 'follow'])
    if temp.blank?
      notification = current_user.active_notifications.new(
        visited_id: id,
        action: 'follow'
      )
      notification.save if notification.valid?
---
SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 3 and visited_id = 2 ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visiter_id", "visited_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["visiter_id", 3], ["visited_id", 2], ["created_at", "2021-04-14 06:29:33.679640"], ["updated_at", "2021-04-14 06:29:33.679640"]]